app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = $1, "title" = $2, "updated_at" = $3 WHERE "articles"."id" = 1  [["text", "Body Text 123"], ["title", "Hey there"], ["updated_at", "2014-08-24 03:21:00.653914"]]

  def create
    if current_user.articles.create(article_params)
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-08-24 04:48:01.793390"], ["text", "hey there"], ["title", "other stuff"], ["updated_at", "2014-08-24 04:48:01.793390"], ["user_id", 1]]