app/controllers/welcome_controller.rb

SELECT "articles".* FROM "articles"
---
  def show
    @articles = Article.all